;; -*- no-byte-compile: t; -*-

;; $DOOMDIR/packages.el

;;; Utility
(package! s)
(package! f)
(package! rg)
(package! ts)
(package! deadgrep)
(package! anzu)
(package! string-inflection)
(package! iedit)
(package! yasnippet)
(package! undo-tree)
(package! visual-fill-column)
(package! imenu-list)
(package! dired-hide-dotfiles)
(package! mixed-pitch)
(package! consult)

;;; Languages
(package! rust-mode)
(package! fish-mode)
(package! flymake-rust)
(package! flycheck-rust)
(package! rustic)
(package! cargo)
(package! racer)
(package! dockerfile-mode)
(package! fish-mode)
(package! nov) ;; read epub from emacs
(package! graphviz-dot-mode)
(package! ahk-mode) ;; auto hotkey
(package! auctex)  ;; better latex
(package! slime)
(package! elpy)

;;; Notetaking
